Revit 2024 API
BuiltInFailures.RebarShapeFailures.ShapeFailure Property
 The displayed Rebar Shape is created using a 'Rebar Bar for Preview'. This bar defines the bend radius displayed in the family. Using this preview bar the drawn shape cannot be completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ShapeFailure { get; }
Visual Basic
Public Shared ReadOnly Property ShapeFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ShapeFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace